app/controllers/accounts_controller.rb

    def create
        byebug
        @account = Account.new(account_params)
        if @account.save
---
INSERT INTO "accounts" ("user_id", "account_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["account_number", 134567890], ["created_at", "2023-08-03 06:26:20.505169"], ["updated_at", "2023-08-03 06:26:20.505169"]]