app/controllers/transactions_controller.rb

SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1  [["user_id", 2]]
---
    def all_transactions
        byebug
        @transaction = Transaction.where(user_id: params[:user_id])
        @transaction.present?