app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
    def index
        byebug
        @user = User.find_by(id: params[:user_id])
        @user.present?

INSERT INTO "users" ("name", "amount", "pin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "jekky"], ["amount", 1000], ["pin", 4321], ["created_at", "2023-08-04 07:45:10.148366"], ["updated_at", "2023-08-04 07:45:10.148366"]]
---
    def create
        byebug
        @user = User.new(user_params)
        if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "amount" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["amount", 15000], ["updated_at", "2023-08-03 09:37:27.914101"], ["id", 2]]
INSERT INTO "transactions" ("transaction_type", "t_amount", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["transaction_type", "deposite"], ["t_amount", 10000], ["user_id", 2], ["created_at", "2023-08-04 07:46:12.170725"], ["updated_at", "2023-08-04 07:46:12.170725"]]
---
   def deposite
    byebug
    @deposite = params[:deposite]
    @user = User.find_by(id: params[:user_id])
    if @user.present?
            @amount = @user.amount
            @pin = @user.pin
            if @pin == params[:pin].to_i
            @d_amount = @amount+@deposite.to_i
             @user.update(amount: @d_amount)
             @t = Transaction.create(user_id: @user.id , t_amount: @deposite, transaction_type: "deposite")

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "amount" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["amount", 10700], ["updated_at", "2023-08-04 05:20:05.781461"], ["id", 14]]
---
    def withdraw
        byebug
        @withdraw_money = params[:withdraw]
        @user = User.find_by(id: params[:user_id])
        if @user.present?
            @amount = @user.amount
            @pin = @user.pin
            if @pin == params[:pin].to_i
                if @amount > @withdraw_money.to_i
                    @w_amount = @amount-@withdraw_money.to_i
                    @user.update(amount: @w_amount)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "amount" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["amount", 7000], ["updated_at", "2023-08-04 08:13:06.382655"], ["id", 1]]
INSERT INTO "transactions" ("transaction_type", "t_amount", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["transaction_type", "receive"], ["t_amount", 1000], ["user_id", 1], ["created_at", "2023-08-04 08:13:06.465309"], ["updated_at", "2023-08-04 08:13:06.465309"]]
---
    def transfer
        byebug
        @transfer_money = params[:transfer_money]
        @user1 = User.find_by(id: params[:user_id])
        @user2 = User.find_by(id: params[:id])
        if @user1&&@user2.present?
            @amount1 = @user1.amount
            @amount2 = @user2.amount
            @pin = @user1.pin
            if @pin == params[:pin].to_i
                if @transfer_money.to_i <= @amount1
                    @t_money = @amount1-@transfer_money.to_i
                    @ta_money =  @amount2+@transfer_money.to_i
                    @user1.update(amount: @t_money)
                     @user2.update(amount: @ta_money)
                      @t = Transaction.create(user_id: @user1.id, t_amount: @transfer_money, transaction_type: "transfer")